Revit 2027 API
MultiServerService Properties
The MultiServerService type exposes the following members.
Properties
Name | Description
Description |  The description for the service
(Inherited from ExternalService)
ExecutionPolicy |  Specifies how a multi-server service executes servers during its execution.
IsSerializable |  Indicates whether executions of the service requires serialization in documents or not.
(Inherited from ExternalService)
IsValidObject |  Specifies whether the .NET object represents a valid Revit entity.
(Inherited from ExternalService)
Name |  The name of the service
(Inherited from ExternalService)
NumberOfServers |  Indicates the number of servers currently registered with the service.
(Inherited from ExternalService)
ServiceId |  The Id of the service
(Inherited from ExternalService)
SupportActivation |  Indicates if the service supports activation/deactivation of the servers.
(Inherited from ExternalService)
VendorId |  The vendor who provided the service
(Inherited from ExternalService)
Top
See Also
Reference
MultiServerService Class
Autodesk.Revit.DB.ExternalService Namespace